OpenFOAM_v2112/ChapterSample/chapter4_mtSTL/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform  (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    //#include "include/fixedInlet"

    outlet
    {
        type zeroGradient;
    }

    inlet
    {
        type fixedValue;
        value uniform (10 0 0);
    }

    walls
    {
        type noSlip;
    }

    //#include "include/frontBackUpperPatches"
}


// ************************************************************************* //
