OpenFOAM_v2112/ChapterSample/chapter4_mtSTL/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    //#include "include/fixedInlet"

    outlet
    {
        type zeroGradient;
    }

    inlet
    {
        type turbulentMixingLengthFrequencyInlet;
        mixingLength 0.005;
        k k;
        value uniform 1;
    }

    walls
    {
        type omegaWallFunction;
        value uniform 0;
    }

    //#include "include/frontBackUpperPatches"
}

// ************************************************************************* //
